app/controllers/pokemons_controller.rb

	def create
		@pokemon = Pokemon.new pokemon_params
		@pokemon.health = 100
		@pokemon.level = 1
		@pokemon.trainer = current_trainer
		@pokemon.save
---
INSERT INTO "pokemons" ("name", "health", "level", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bubbles"], ["health", 100], ["level", 1], ["trainer_id", 5], ["created_at", "2015-10-30 21:11:42.338357"], ["updated_at", "2015-10-30 21:11:42.338357"]]

	def capture
		@pokemon1 = Pokemon.find params[:id]
		@pokemon1.trainer = current_trainer
		@pokemon1.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2015-10-29 23:11:49.533212"], ["id", 3]]

	def damage
		@poke = Pokemon.find params[:id]
		@poke.health -= 10
		@poke.save
		if @poke.health <= 0
			@poke.destroy
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2015-10-30 19:48:11.024767"], ["id", 2]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 2]]