app/views/trainers/show.html.erb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]
---
<% if @trainer.pokemons %>
	<% @trainer.pokemons.each do |p| %>